{
  "model_type": "custom_classifier",
  "num_labels": 66,
  "id2label": {
    "0": "점결탄",
    "1": "산화마그네슘",
    "2": "오븐 코크스",
    "3": "콜타르",
    "4": "직접 환원철",
    "5": "일산화탄소",
    "6": "천연가스",
    "7": "갈탄",
    "8": "페트롤 및 SBP",
    "9": "역청",
    "10": "냉각수",
    "11": "강철",
    "12": "석회석",
    "13": "산업폐기물",
    "14": "메탄",
    "15": "고로 슬래그",
    "16": "철 스크랩",
    "17": "분진",
    "18": "윤활유",
    "19": "액화석유가스",
    "20": "강철 스크랩",
    "21": "탄산리튬",
    "22": "경유",
    "23": "잔류 연료유",
    "24": "전기",
    "25": "무연탄",
    "26": "오일 셰일",
    "27": "철광석",
    "28": "탄산수소나트륨",
    "29": "탄산바륨",
    "30": "포장재",
    "31": "액화 천연가스",
    "32": "슬러지",
    "33": "소다회",
    "34": "산화바륨",
    "35": "가스공장 가스",
    "36": "폐유",
    "37": "EAF 탄소 전극",
    "38": "압연 스케일",
    "39": "코크스 오븐 가스",
    "40": "EAF 충전 탄소",
    "41": "고로가스",
    "42": "열간성형철 (HBI)",
    "43": "피트 (Peat)",
    "44": "선철",
    "45": "원유",
    "46": "산소 제강로 가스",
    "47": "열유입",
    "48": "절삭칩",
    "49": "아역청탄",
    "50": "마그네사이트",
    "51": "석유 코크스",
    "52": "펠렛",
    "53": "오리멀전",
    "54": "액화 석유가스",
    "55": "등유",
    "56": "소성가스",
    "57": "에탄",
    "58": "산화칼슘",
    "59": "나프타",
    "60": "철",
    "61": "능철광",
    "62": "소결광",
    "63": "고온 성형 환원철",
    "64": "휘발유",
    "65": "탄산스트론튬"
  },
  "label2id": {
    "점결탄": 0,
    "산화마그네슘": 1,
    "오븐 코크스": 2,
    "콜타르": 3,
    "직접 환원철": 4,
    "일산화탄소": 5,
    "천연가스": 6,
    "갈탄": 7,
    "페트롤 및 SBP": 8,
    "역청": 9,
    "냉각수": 10,
    "강철": 11,
    "석회석": 12,
    "산업폐기물": 13,
    "메탄": 14,
    "고로 슬래그": 15,
    "철 스크랩": 16,
    "분진": 17,
    "윤활유": 18,
    "액화석유가스": 19,
    "강철 스크랩": 20,
    "탄산리튬": 21,
    "경유": 22,
    "잔류 연료유": 23,
    "전기": 24,
    "무연탄": 25,
    "오일 셰일": 26,
    "철광석": 27,
    "탄산수소나트륨": 28,
    "탄산바륨": 29,
    "포장재": 30,
    "액화 천연가스": 31,
    "슬러지": 32,
    "소다회": 33,
    "산화바륨": 34,
    "가스공장 가스": 35,
    "폐유": 36,
    "EAF 탄소 전극": 37,
    "압연 스케일": 38,
    "코크스 오븐 가스": 39,
    "EAF 충전 탄소": 40,
    "고로가스": 41,
    "열간성형철 (HBI)": 42,
    "피트 (Peat)": 43,
    "선철": 44,
    "원유": 45,
    "산소 제강로 가스": 46,
    "열유입": 47,
    "절삭칩": 48,
    "아역청탄": 49,
    "마그네사이트": 50,
    "석유 코크스": 51,
    "펠렛": 52,
    "오리멀전": 53,
    "액화 석유가스": 54,
    "등유": 55,
    "소성가스": 56,
    "에탄": 57,
    "산화칼슘": 58,
    "나프타": 59,
    "철": 60,
    "능철광": 61,
    "소결광": 62,
    "고온 성형 환원철": 63,
    "휘발유": 64,
    "탄산스트론튬": 65
  },
  "architectures": [
    "SimpleClassifier"
  ],
  "max_position_embeddings": 512,
  "hidden_size": 256,
  "intermediate_size": 128
}